# Essential taps for the core configuration
tap "felixkratz/formulae"
tap "homebrew/services"
tap "koekeishiya/formulae"

# Core packages for the dotfiles
brew "coreutils" # Needed for dircolors
brew "dircolors"
brew "neofetch"
brew "neovim"
brew "starship"
brew "stow"
brew "tmux"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Dependencies for key applications
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd" # Recommended for Aerospace keybindings
brew "lua" # Required for Neovim (LazyVim)

# Dependencies for LayzVim
brew "git"
brew "curl"
brew "fzf"
brew "ripgrep"
brew "fd"
# A C compiler is needed for nvim-treesitter. macOS comes with the `clang` compiler,
# which works well. If you are on a different OS, you may need to install one (e.g., `gcc`).

# Core Casks (GUI applications)
cask "aerospace"
cask "font-fira-code-nerd-font" # Or whichever nerd font you use
cask "ghostty"
cask "kitty"
cask "raycast"
